TienHuyIoT/ESP32Async-ESPAsyncWebServer/src/AsyncWebSocket.cpp
  if (!buffer) {
    return 0;
  }

  va_start(arg, formatP);
  len = vsnprintf_P(buffer, len + 1, formatP, arg);
  va_end(arg);

  bool enqueued = text(buffer, len);
  delete[] buffer;
  return enqueued ? len : 0;
}
#endif

namespace {
AsyncWebSocketSharedBuffer makeSharedBuffer(const uint8_t *message, size_t len) {
  // auto raw_vec = new (std::nothrow) std::vector<uint8_t>(len);
  std::vector<uint8_t>* raw_vec = nullptr;
  try {
    raw_vec = new std::vector<uint8_t>(len);
  } catch (const std::bad_alloc&) {
    return nullptr; // allocation failed
  }

  if (!raw_vec) {
    return nullptr;
  }

  AsyncWebSocketSharedBuffer buffer;
  buffer.reset(raw_vec);
  
  if (len > 0) {
    std::memcpy(buffer->data(), message, len);
  }
  return buffer;
}
}  // namespace

bool AsyncWebSocketClient::text(AsyncWebSocketMessageBuffer *buffer) {
  bool enqueued = false;
  if (buffer) {
    enqueued = text(std::move(buffer->_buffer));
    delete buffer;
  }
  return enqueued;
}

bool AsyncWebSocketClient::text(AsyncWebSocketSharedBuffer buffer) {
  return _queueMessage(buffer);
}

bool AsyncWebSocketClient::text(const uint8_t *message, size_t len) {
  return text(makeSharedBuffer(message, len));
}

bool AsyncWebSocketClient::text(const char *message, size_t len) {
  return text((const uint8_t *)message, len);
}

bool AsyncWebSocketClient::text(const char *message) {
  return text(message, strlen(message));
}

bool AsyncWebSocketClient::text(const String &message) {
  return text(message.c_str(), message.length());
}

#ifdef ESP8266
bool AsyncWebSocketClient::text(const __FlashStringHelper *data) {
  PGM_P p = reinterpret_cast<PGM_P>(data);

  size_t n = 0;
  while (1) {
    if (pgm_read_byte(p + n) == 0) {
      break;
    }
    n += 1;
  }

  char *message = (char *)malloc(n + 1);
  bool enqueued = false;
  if (message) {
    memcpy_P(message, p, n);
    message[n] = 0;
    enqueued = text(message, n);
    free(message);
  }
  return enqueued;
}
#endif  // ESP8266

bool AsyncWebSocketClient::binary(AsyncWebSocketMessageBuffer *buffer) {
  bool enqueued = false;
  if (buffer) {
    enqueued = binary(std::move(buffer->_buffer));
    delete buffer;
  }
  return enqueued;
}

bool AsyncWebSocketClient::binary(AsyncWebSocketSharedBuffer buffer) {
  return _queueMessage(buffer, WS_BINARY);
}

bool AsyncWebSocketClient::binary(const uint8_t *message, size_t len) {
  return binary(makeSharedBuffer(message, len));
}

bool AsyncWebSocketClient::binary(const char *message, size_t len) {
  return binary((const uint8_t *)message, len);
}

bool AsyncWebSocketClient::binary(const char *message) {
  return binary(message, strlen(message));
}

bool AsyncWebSocketClient::binary(const String &message) {
  return binary(message.c_str(), message.length());
}

#ifdef ESP8266
bool AsyncWebSocketClient::binary(const __FlashStringHelper *data, size_t len) {
  PGM_P p = reinterpret_cast<PGM_P>(data);
  char *message = (char *)malloc(len);
  bool enqueued = false;
  if (message) {
    memcpy_P(message, p, len);
    enqueued = binary(message, len);
    free(message);
  }
  return enqueued;
}
#endif

/*
 * Async Web Socket - Each separate socket location
 */

void AsyncWebSocket::_handleEvent(AsyncWebSocketClient *client, AwsEventType type, void *arg, uint8_t *data, size_t len) {
  if (_eventHandler != NULL) {
    _eventHandler(this, client, type, arg, data, len);
  }
}

AsyncWebSocketClient *AsyncWebSocket::_newClient(AsyncWebServerRequest *request) {
#if (defined ESP32) && (CLIENTS_LIST_THREAD_SAFETY == 1)
  std::lock_guard<std::recursive_mutex> lock(_client_queue_lock);
#endif
  _clients.emplace_back(request, this);
  _handleEvent(&_clients.back(), WS_EVT_CONNECT, request, NULL, 0);
  return &_clients.back();
}

void AsyncWebSocket::_handleDisconnect(AsyncWebSocketClient *client) {
#if (defined ESP32) && (CLIENTS_LIST_THREAD_SAFETY == 1)
  std::lock_guard<std::recursive_mutex> lock(_client_queue_lock);
#endif
  const auto client_id = client->id();
  const auto iter = std::find_if(std::begin(_clients), std::end(_clients), [client_id](const AsyncWebSocketClient &c) {
    return c.id() == client_id;
  });
  if (iter != std::end(_clients)) {
    _clients.erase(iter);
  }
}

bool AsyncWebSocket::availableForWriteAll() {
#if (defined ESP32) && (CLIENTS_LIST_THREAD_SAFETY == 1)
  std::lock_guard<std::recursive_mutex> lock(_client_queue_lock);
#endif
  return std::none_of(std::begin(_clients), std::end(_clients), [](const AsyncWebSocketClient &c) {
    return c.queueIsFull();
  });
}

bool AsyncWebSocket::availableForWrite(uint32_t id) {
#if (defined ESP32) && (CLIENTS_LIST_THREAD_SAFETY == 1)
  std::lock_guard<std::recursive_mutex> lock(_client_queue_lock);
#endif
  const auto iter = std::find_if(std::begin(_clients), std::end(_clients), [id](const AsyncWebSocketClient &c) {
    return c.id() == id;
  });
  if (iter == std::end(_clients)) {
    return false;
  }
  return iter->status() == WS_CONNECTED && !iter->queueIsFull();
}

size_t AsyncWebSocket::countAll(bool isLock) const {
#if (defined ESP32) && (CLIENTS_LIST_THREAD_SAFETY == 1)
  std::lock_guard<std::recursive_mutex> lock(_client_queue_lock);
#endif
  return std::count_if(std::begin(_clients), std::end(_clients), [](const AsyncWebSocketClient &c) {
    return true;
  });
}

size_t AsyncWebSocket::count(AwsClientStatus status, bool isLock) const {
#if (defined ESP32) && (CLIENTS_LIST_THREAD_SAFETY == 1)
  std::lock_guard<std::recursive_mutex> lock(_client_queue_lock);
#endif
  return std::count_if(std::begin(_clients), std::end(_clients), [status](const AsyncWebSocketClient &c) {
    return c.status() == status;
  });
}

AsyncWebSocketClient *AsyncWebSocket::client(uint32_t id, AwsClientStatus status) {
#if (defined ESP32) && (CLIENTS_LIST_THREAD_SAFETY == 1)
  std::lock_guard<std::recursive_mutex> lock(_client_queue_lock);
#endif
  const auto iter = std::find_if(_clients.begin(), _clients.end(), [id, status](const AsyncWebSocketClient &c) {
    return c.id() == id && c.status() == status;
  });
  if (iter == std::end(_clients)) {
    return nullptr;
  }
  return &(*iter);
}
  
AsyncWebSocketClient* AsyncWebSocket::client(AwsClientStatus status) {
#if (defined ESP32) && (CLIENTS_LIST_THREAD_SAFETY == 1)
  std::lock_guard<std::recursive_mutex> lock(_client_queue_lock);
#endif
  const auto iter = std::find_if(_clients.begin(), _clients.end(), [status](const AsyncWebSocketClient &c) {
    return c.status() == status;
  });
  if (iter == std::end(_clients)) {
    return nullptr;
  }
  return &(*iter);
}

